unres = ["الغاء تقييد", "الغاء تقييده", "غير مقيد", "ات", "الغاء الحظر"]
spe = ["رفع جندي", "جندي"]
adm = ["رفع زعيم", "زعيم"]
rev = ["رفع حاكم", "حاكم"]
b_b = ["رفع وزير", "وزير"]
bu = ["رفع امير", "امير"]
res = ["تقييد", "قيده", "ق", "حظر"]
unspe = ["تنزيل جندي"]
unadm = ["تنزيل زعيم"]
unrev = ["تنزيل حاكم"]
unb_bu = ["تنزيل وزير"]
mute = ["كتم", "كتمه", "اكتمه"]
unmute = ["الغاء الكتم", "لا تكتمه", "فتح الكتم"]
aide = ["ايدي", "ا"]


unsub = "{name}  ⌔︙عليك الاشتراك في قناة البوت لأستخدام الاوامر"
user_no_pre = "{name} ⌔︙ عذرا, هذا الامر مخصص فقط ل {rtba}"
bot_no_pre = "{name} ⌔︙ عذرا , يجب اعطاء البوت جميع صلاحيات الادن"
cont_bot = "{name} ⌔︙عذرآ لا تستطيع استخدام الامر على البوت"
cont_cret = "{name} ⌔︙ عذرا, لايمكم استخدام الامر على الملك"
contself = "{name} ⌔︙ عذرا لايمكنك استخدام الامر على نفسك"
pre_more = "{name} ⌔︙ عذرا المستخدم الذي تريد رفعه يملك رتبه اعلى" 
dim_less = "{name} ⌔︙ عذرا المستخدم الذي تريد تنزيله يملك رتبه اقل"
samepre = "{name}  ⌔︙ عذرا المستخدم يملك نفس الرتبه"
pre_by_anthor = "{name} ⌔︙ عذرا المستخدم تم ترقيته من قبل مستخد اخر"
hasres = "{name} ⌔︙ عذرا المستخدم تم تقييده بالفعل"
nullpre = "{name} ⌔︙ عذرا, لايمكن حظر الحكام  فما فوق"
not_B = "{name} ⌔︙ عذرا, المستخدم ليس امير"
hasunres = "{name} ⌔︙ عذرا المستخدم غير مقيد بالفعل"
was_= " ————————————— \n ⌔︙المستخدم ← {user} \n ⌔︙تم {what}  \n ⌔︙ بواسطه ←  {admin}"
not_in_muted_user = "{name} ⌔︙ عذرا, المستخدم غير مكتوم بالفعل "
in_muted_user = "{name} ⌔︙ عذرا, المستخدم مكتوم بالفعل "










Admin_commands = """
⌔︙اوامر زعماء المجموعه ...
—————————————
⌔︙الاوامر التالية ← {بالرد ، بالمعرف}
⌔︙كتم ← الغاء كتم
⌔︙انذار ← {بالرد ، بالمعرف}

⌔︙عرض القوائم كما يلي ...
—————————————
⌔︙المنشئين الاساسيين ، المنشئين 
⌔︙المدراء ، الادمنيه ، المميزين
⌔︙المشرفين ، المكتومين

—————————————
⌔︙تثبيت ، الغاء تثبيت
⌔︙الرابط ، الاعدادات ، الحمايه
⌔︙الترحيب ، القوانين
⌔︙تحكم ← {بالرد ، بالمعرف}

—————————————
⌔︙تفعيل ، تعطيل ← الاوامر التاليه :
⌔︙الترحيب ، الرابط ، التحقق
⌔︙الالعاب ، التحشيش
⌔︙اطردني


—————————————
⌔︙مسح ← الاوامر التاليه
⌔︙القوائم ، قائمه المنع ، المميزين
⌔︙الرابط ، القوانين ، الصوره
⌔︙مسح ← { عدد }
⌔︙مسح ← { بالرد }


⌔︙اوامر  الادمنيه 
—————————————
⌔︙ايدي ، ايدي بالرد ، رسائلي
⌔︙تفاعلي ، بايو ، زوجني
⌔︙لقبي ، لقبه { بالرد } 
⌔︙اسمي ، معرفي ، رابطي
⌔︙جهاتي ، سحكاتي ، نقاطي
⌔︙بيع نقاطي + العدد
⌔︙مسح نقاطي ، التفاعل

⌔︙انطق + الكلمه
⌔︙منشن ، نداء ، ترند
⌔︙الوقت ، الساعه ، التاريخ
⌔︙زخرفه ، زخرفه + اسم
⌔︙ ، غنيلي ، اغنيه
⌔︙همسه ، اسم برجك ، صورتي

⌔︙صلاحياتي ، رتبتي ، نزلني 
⌔︙صلاحياته ← {بالرد ، بالمعرف}
⌔︙الرتبه ← {بالرد ، بالمعرف}
⌔︙تفاعله ← {بالرد ، بالمعرف}
⌔︙كشف ← {بالرد ، بالمعرف}
⌔︙رابطه ← {بالرد ، بالمعرف}
"""





Reeve_commands = """
⌔︙اوامر الحكام في المجموعه
—————————————
⌔️︙كشف ، طرد ، قفل ← البوتات
⌔︙قفل البوتات ← بالطرد
⌔︙فحص ← البوت
⌔︙مسح التعديل 

—————————————
⌔︙حظر ، طرد اسم + الاسم
⌔︙الغاء حظر اسم + الاسم 
⌔︙الاسماء المحظوره
⌔︙مسح الاسماء المحظوره
—————————————
⌔︙لتغيير رد الرتب في البوت

—————————————
⌔︙المطور ، المالك 
—————————————
⌔︙ضع لقب + لقب←{ بالرد }
⌔︙وضع ، ضع ← الاوامر التاليه
⌔︙اسم + اسم المجموعه
⌔︙رابط ، صوره
⌔︙قوانين ، وصف ،الترحيب 
—————————————
⌔︙مسح الرابط ، انشاء رابط
⌔︙تفعيل ، تعطيل الرابط العادي 
—————————————
⌔︙تفعيل ، تعطيل ← التالي :
⌔︙الايدي ، الايدي بالصوره
⌔︙الترحيب ، منشن ، انطق
⌔︙صورتي ، اسمي ؛ نبذه
⌔︙الردود ، الابراج ، التفاعل
⌔︙غنيلي ، شعر ، قصيده 
⌔︙الاذكار ، الاقتباس . وظيفته :(ارسال اذكار او اقتباس كل 1 ساعه)
—————————————
⌔︙مسح ← + { الامر } 
⌔︙المحظورين
⌔︙المكتومين ← المقيدين
—————————————
⌔︙اضف ، مسح ← { رد }
⌔︙الردود ، قائمه الردود 
⌔︙مسح الردود
⌔︙تاك عام ، all
⌔︙الكلمه + @all
⌔︙نداء للكل
⌔︙سجل الاداره 
⌔︙وظيفته :(عرض تفصيلي للمشرفين مع تفاعلهم)
⌔︙اضف رسائل + العدد { بالرد}
⌔︙اضف نقاط + العدد { بالرد }
⌔︙اضف سحكات + العدد {بالرد}
"""



Founders_commands = """"
⌔︙اوامر الرئساء 
—————————————
⌔︙رفع ، تنزيل ←{ ادمن }
⌔︙رفع ، تنزيل ←{ مدير }
⌔︙ضع لقب + لقب←{ بالرد }
⌔︙صلاحيات المجموعه
⌔︙صلاحيات المشرفين
⌔︙مسح نقاطه ، رسائله←{بالرد ، بالمعرف}
⌔︙تفعيل ، تعطيل ← البنك
⌔︙صنع كود 
⌔︙وظيفته :{ صنع كود تمويل }
—————————————


⌔︙اوامر المنشئ المجموعه
—————————————
⌔︙رفع ، تنزيل←{ مدير }
⌔︙المدراء ، مسح المدراء
⌔︙تغيير ، مسح ←{ الايدي }
⌔︙تعيين ، مسح←{ الايدي }
⌔︙اضف ، مسح ← { امر }
—————————————
⌔︙تفعيل ، تعطيل ← التالي :
⌔︙الردود العامه ، ردود البوت
⌔︙الردود انلاين ، الردود انلاين عام
⌔︙الطرد ، الحظر ، الرفع ، انذار 
⌔︙نداء ، النداء التلقائي ، نداء للكل
⌔︙التاك التلقائي ، جاوبه ، سجل الاداره
⌔︙تاك الاسم ، حظر الاسماء
—————————————
⌔︙تفعيل ، تعطيل التوحيد
⌔︙ضع التوحيد 
"""



Bot_commands = """⌔︙اوامــر البــوت الرئيسيـة 
—————————————
⌔︙{ م1 } ← اوامــر الحمايـه
⌔︙{ م2 } ← اوامــر التوب
⌔︙{ م3 } ← اوامــر التعليمات
⌔︙{ م4 } ← اوامر التحشيش
⌔︙{ م5 } ← اوامـــر التسليـه
⌔︙{ م6 } ← اوامـــر البنـــــك
⌔︙{ م7 } ← اوامـــر التحكم 
⌔︙{ م8 } ← اوامـــر التنظيف 
⌔︙{ م9 } ←  الالعاب 
"""
information = """____________________ هذه لوحه التعليمات الخاصه:
        الرفع
        لا يمكن رفع نفسك
        لا يمكن رفع البوت
        لا يمكن رفع المالك
        لا يمكنك رفع الشخص الذي يملك رتبه اعلى
        لا يمكنك رفع شخص اذا قد تمت ترقيته من قبل شخص اخر
        الرتب من المميز الى المدير يتم ترقيتهم من صاحب رتبه المنشئ الأساسي فما فوق
        اما من المنشئ الأساسي فما فوق  فيتم ترقيتهم من قبل المنشئ فما فوق
        الصلاحية من المنشئ الأساسي فما فوق

        التنزيل
        لا يمكن تنزيل نفسك
        لا يمكن تنزيل البوت
        لا يمكن تنزيل المالك
        لا يمكنك تنزيل الشخص الذي يملك رتبه اقل
        لا يمكنك تنزيل شخص اذا قد تمت تنزيلهم من قبل شخص اخر
        الرتب من المميز الى المدير يتم تنزيلهم من صاحب رتبه المنشئ الأساسي فما فوق
        الصلاحية من المنشئ الأساسي فما فوق

        الكتم والحظر والطرد
        لا يمكن (الكتم والحظر والطرد) نفسك
        لا يمكن (الكتم والحظر والطرد) البوت
        لا يمكن (الكتم والحظر والطرد) المالك
        خاصيه الكتم مفعله للإصحاب الرتب من العضو الى الادمن
        الصلاحية من المدير فما فوق"""






dict_protection = {
    "all_prot1": "off",
    "links1":  "off",
    "mentions1":  "off",
    "edit_msg1":  "off",
    "looping1":  "off",
    "cliches1":  "off",
    "forwording1":  "off",
    "cursing1":  "off",
    "ir_lang1":  "off",
    "en_lang1":  "off",
    "disbelief1":  "off",
}


BioExtra = [
    ". ≭احُب الفراشات والغيم وجهَك ❤️❤️",
    ". ≭احبك بڪل قابلية الإنسان على الحُب ❤️❤️"<
    ".≭لم تأتي بك الصدفه ،خصك الله لي ❤️❤️"<
    "علاقتي تنتهي معك بمجرد أن أوضح لك ما يزعجني مرتين و لا تفهم 💓",
    "انتَ الجَميل اللي لايق عليه الغَرام وانتَ اللي عُمري ماخلص فيه الكَلام.❤️",
    "بانيَلك بـَ گلبيّ بيَوت بَس طأحَن .",
    "منــــــــور اليـــــــــــوم 💡🙈",
    "اسوأ شعور لمن تحس ان اللي لك صار لغيرك .",
    "شعور الإنعزال مريح بدون إهتمامات مُزيفة  .",
    "ودي اختفي حتى عن نفسي  .",
    "بكُل أُغنية حِلوة أغمض عيوني وأتخيلك .",
    "اللي يتركك ف وقت انهيارك ماله حق يرجع ف وقت سعادتك .",
    "التبريرات لا تغير في الخيبة شيئا .",
    "انا مع الغيرة احارب كل شعور .",
    "افضل طرق الانتقام الاقتراب بدون تقدير .",
    "يفقد الانسان مره , ويبقى خايف للابد  .",
    "اللي ضامن رِضاك بيزعّلك كثير  .",
    "ياليتك سماي واتأملك كل يوم .",
    "من لا يفهم صمتك لا يفهم حديثك ."
]

ReactionsRate = {
    100: "مـلگ آلتـً๋ـ๘ٌ๋ــليڪـ๋رآم",
    90 : "تـً๋ـ๘ٌ๋ــفـ‌๋ـৡـآعـ๋ـᬼٰ◌ـل غـ๋نمبــཽੁـلهہ",
    80 : "ملڪـ๋ آلتـً๋ـ๘ٌ๋ــفـ‌๋ـৡـآعـ๋ـᬼٰ◌ـل",
    70 : "شـ๋‌ـ‌๋ـ★ـگدٰ تـً๋ـ๘ٌ๋ــحـ๋ـ✮ﮩ‌๋ـيـ‌ﮩ‌جـ๋ــٰٰ◌ٰٰـّٰـي؟",
    60 : "بــཽੁـآلعـ๋ـᬼٰ◌ـ مسـ๋‌ـﮧچل",
    50 : "جـ๋ــٰٰ◌ٰٰـّٰـيدٰ جـ๋ــٰٰ◌ٰٰـّٰـدٰآ",
    40 : "آتـً๋ـ๘ٌ๋ــفـ‌๋ـৡـآعـ๋ـᬼٰ◌ـل أڪـ๋ثـً๋ـ๘ٌ๋ــر",
    30 : "بــཽੁـسـ๋‌ـﮧ آتـً๋ـ๘ٌ๋ــفـ‌๋ـৡـآعـ๋ـᬼٰ◌ـل ويآنهہ",
    20 : "هہآي ڪـ๋ل قـ๋ــ҉ैॣـــوتـً๋ـ๘ٌ๋ــڪـ๋؟",
    10 : "ميتـً๋ـ๘ٌ๋ــ 🌛🍁ֆ"
}



def RectionsRate_count(num):
    if num >= 10000:
        return ReactionsRate[100]
    elif num >=7000:
        return ReactionsRate[90]
    elif num >= 5000:
        return ReactionsRate[80]
    elif num >= 1000:
        return ReactionsRate[70]
    elif num >= 500:
        return ReactionsRate[60]
    elif num >= 100:
        return ReactionsRate[50]
    elif num >= 100:
        return ReactionsRate[40]
    elif num >= 50:
        return ReactionsRate[30]
    elif num >= 10:
        return ReactionsRate[20]
    elif num >= 0:
        return ReactionsRate[10]



Rations = [100,90,80,70,60,50,40,30,20,10]

SayBot = [
    'بوت', "انت بوت", "بوتي","ههه بوت"
]

ReplyBot = [
    "انجب انت البوت", "امشي ولي", "عوفني مالي خلكك ", "بابا متكلي شبيك؟", "وجعي شتريد؟", "انت البوت", "كوم صبلي جاي", "انجب لا اصيح الملك هسه!", "ملكي, هذا يغلط علي *"
]

ReplyNameBot = [
    "اني نايم من اكعد ارد عليك", "ها, شتريد مني؟", "شوف البقيه اني ضايج", "بابا متكلي شتريد مني", "عوفني صاعد اتصال وي الحب", "خاااااا"
]
ieat = [
"﴿مَنْ عَمِلَ مِنكُمْ سُوٓءًۢا بِجَهَالَةٍۢ ثُمَّ تَابَ مِنۢ بَعْدِهِ وَأَصْلَحَ فَأَنَّهُ غَفُورٌ رَّحِيمٌ﴾.",
"اللهم إرحم قبوراً ضمت في جوفها من نحب، وأجعلها برداً وسلاماً يا الله .",
"﴿ وَذَا النّونِ إِذ ذَهَبَ مُغاضِبًا ﴾",
"﴿رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي يَفْقَهُوا قَوْلِي﴾",
"‏صلّو عَلى من بكَى شوقاً لرؤيتنِا ، ﷺ",
"{ لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ}",
"‏اسقِ طيراً، و أطعِم هِراً، وتصدق  ‏على عاملاً أو مسكيناً، وساعد شيخاً كبيراً،  ‏فلا تدري أي عمل فيهم ينجيك من النار  ‏ويدخلك الجنة .",
"اللهم اغفرلي واغفر لجميع المسلمين يا الله",
"استغفر الله العظيم من كل ذنب عظيم",
"وأشفِ أنت الشافي  . .",
"‏إذا اشتدَّ حرّ صدوركم = فأبرِدوا بالقرآن.",
"اللهمَّ يا مقلب القلوب ثَبِّتْ قلوبَنا على دينِكَ .",
"ضاقت بيّ الارض يالله , أسعها فإني بحاجتك وليسَ لي غيرك .",
"إِذۡ نَادَىٰ رَبَّهُۥ نِدَآءً خَفِيّٗا 🤍.",
"﴿ وَٱصْبِرْ لِحُكْمِ رَبِّكَ فَإِنَّكَ بِأَعْيُنِنَا ۖ وَسَبِّحْ بِحَمْدِ رَبِّكَ حِينَ تَقُومُ ﴾.",
"((   فَسَبِّحۡ بِحَمۡدِ رَبِّكَ وَكُن مِّنَ ٱلسَّٰجِدِينَ   ))",
"‏وَاسْتَغْفِرِ اللَّهَ إِنَّ اللَّهَ كَانَ غَفُورًا رَحِيمًا",
"(فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا)",
"﴿ وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ ﴾",
"صلّوا على نبيّنا محمد ﷺ .",
"أستغفِرُ الله العظيم وأتوبُ إليه ..",
"باللهِ لا بالنَّاسِ تُقْضَى الحَوَائِجُ ❤️",
"‏﴿أَيْنَمَا تَكُونُوا يُدْرِككُّمُ الْمَوْتُ وَلَوْ كُنتُمْ فِي بُرُوجٍ مُّشَيَّدَةٍ ۗ﴾.",
"ربنا اغفر لنا ولوالدينا وللمؤمنين وللمؤمنات انك غفور رحيم .",
"هّوِن عليك فما هي إلا دُنيا .",
"اللهم صلّ وسلم على سيدنا مُحمد .",
"اللهم إملأ قلبي حُبًا لك، وتعلقًا بك، وإقبالًا عليك ،ولا تعلقه بأمر من أمور الدنيا أو بأحدٍ من خلقك .",
"اللهُم أنزل غيث شفائك على أجسادٌ تتألم ..",
"يَارب اِنزَعَ كُلُ ضِيقّ مَن صَدرِي .",
"‏﴿ يَا حَسْرَةً عَلَى الْعِبَادِ ۚ ﴾",
"﴿ لِيَجْزِىَ ٱللَّهُ كُلَّ نَفْسٍۢ مَّا كَسَبَتْ ۚ إِنَّ ٱللَّهَ سَرِيعُ ٱلْحِسَابِ ﴾.",
"أستغفر الله العظيم وأتوبُ إليه .",
"وَجعّلي مِن جبر الخَواطِر ، نصيب .",
"سيُفرحني الله ، يوماً قريباً جداً .",
"‏﴿ فَوَقاهُمُ اللَّهُ شَرَّ ذلِكَ اليَومِ وَلَقّاهُم نَضرَةً وَسُرورًا ﴾",
"ربي لا تريني  بأمي بأساً يبكيني واجعلني بِها من البارين . .",
"سألتك رباه أن تَهدني ♥️",
"إلا لهو ولعِب",
"‏﴿ فَأَمَّآ إِن كَانَ مِنَ الْمُقَرَّبِينَ۝فَرَوْحٌ وَرَيْحَانٌ وَجَنَّتُ نَعِيم ﴾.",
"أستغفرالله العظيم الذي لا اله الا هو الحي القيوم وأتوب إليه عدد خلقه ورضى نفسه وزنة عرشه ومداد كلماته",
"اللهم لا تؤاخذنا بما فعل السفهاء منّا",
"رباهُ..إن لم تكن أنت فمن لها",
"القرآن شفاء للصدور والأبدان..",
"‏{رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ}",
"الحَمدُ لله على نِعمة الإسلام .",
"{ وَٱلَّذِینَ إِذَا فَعَلُوا۟ فَـٰحِشَةً أَوۡ ظَلَمُوۤا۟ أَنفُسَهُمۡ ذَكَرُوا۟ ٱللَّهَ فَٱسۡتَغۡفَرُوا۟ لِذُنُوبِهِمۡ وَمَن یَغۡفِرُ ٱلذُّنُوبَ إِلَّا ٱللَّهُ وَلَمۡ یُصِرُّوا۟ عَلَىٰ مَا فَعَلُوا۟ وَهُمۡ یَعۡلَمُونَ }",
"سورة الكهف نورٌ مابين الجمعتين .",
"الطُرُقُ لا تُسَدُّ علىٰ من أيقَنَ أنَّ عند اللهِ المَخَارِج .",
"سيَبعَثُ اللهُ مِن آفاقِ رحمَتهِ ‏لُطفًا يُرممُ في جَنْبَيكَ ما هُدِما",
"‏اللهم لا تبتلينا فيما لا نستطيع عليه صبرا.",
"الله أكبر كبيراً الحمدلله كثيراً سبحان الله بكرةً واصيلاً  .",
"لا اله الا انت سبحانك اني كنت من الظالمين",
"سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى",
"اللهم قَلبًا صَالحا لا يَعصيكَ",
"{ أَفَلَا یَتُوبُونَ إِلَى ٱللَّهِ وَیَسۡتَغۡفِرُونَهُۥۚ وَٱللَّهُ غَفُورࣱ رَّحِیمࣱ }",
"الحمدلله",
"- ‏ربِ زدني كرهاً في كل شئ لا يرضيك .",
"‏لن يُحمّلك الله شيئًا لا تقوى عليه.",
"- ‏اللهم اهدِنَا، واهدِ بنا، واجعلْنَا سبَبًا لمنِ اهتدىٰ .",
"‏﴿ فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا ﴾",
"‏﴿اقْرَأْ كِتَابَكَ كَفَىٰ بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيبًا﴾",
"{‏إِنَّ اللَّهَ لَذُو فَضْلٍ عَلَى النَّاسِ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَشْكُرُونَ}",
"‏{لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا}",
"ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار",
"لعلّ الله اليوم يُجيبنا كما أجابَ مُوسى عليه السلام: قد أُوتيت سُؤلك يا مُوسى .",
"نستغفرك ربي صمتاً، فرضاً، حزناً و عافية.",
"ملاذ الإنسان أُمه .",
"وافوض أمري إلى الله والله خير الحاكمين والحافظين",
"سَيطيبُ كُل شيء ذاتّ يوم لاتَحزن.",
"‏{فَقُلِ الْحَمْدُ لِلَّهِ}",
"اللهُمّ قوي قَلبي بِك وذكرّني دائمًا بكَ كي لا أتُوه في الدّنيا وأنسَى لمَا خُلقت.",
"اللهُم الجنة لمنْ ذهبت ارواحهم إليك.",
"وَاستغفِرُوا اللهَ إِنَّ اَلله غفورٌ رحيمٌ.",
"اللهم صل على محمد وآل محمد .",
"اللهّم أحسن رحيلي إن حان وقتُه.",
"الله أكبر كبيراً الحمدلله كثيراً سبحان الله بكرةً واصيلاً."
]